[M_MightyMorphin MissionDefinition]
MissionName="Caçada aos Casulos"
MissionDescription="Sir Hammerlock pede que você procure por Varkids em [place]Tundra Express[-place], faça com que eles se transformem e logo em seguida, injete um soro especial em seus casulos para que ele possa estudar suas propriedades metamórficas. Mas, tenha muito cuidado: um Varkid não se transformará se perceber que é o último vivo. Além disso você só pode injetar o soro em casulos de Varkids normais. Varkids Encrenqueiros não servem."
TurnInDescription="Você ajudou Sir Hammerlock a compreender que a natureza nem sempre é tão bela. Às vezes ela pode ser muito traiçoeira."
MissionSummary="Recolha amostras de Varkid."
MissionGiver="Sir Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText="Todos os seres vivos são belos. Até mesmo os mais repugnantes."

[M_MightyMorphin:CollectMoreBugMorphSamples MissionObjectiveDefinition]
ProgressMessage="Recolha amostras de Varkid Mutante"

[M_MightyMorphin:FindBugMorph MissionObjectiveDefinition]
ProgressMessage="Encontre alguns Varkids"

[M_MightyMorphin:KillMutatedBugMorph MissionObjectiveDefinition]
ProgressMessage="Elimine o Varkid Mutante"

[M_MightyMorphin:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MightyMorphin:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MightyMorphin:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MightyMorphin:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hammerlock pede que você procure por Varkids em [place]Tundra Express[-place], faça com que eles se transformem e logo em seguida, injete um soro especial em seus casulos para que ele possa estudar suas propriedades metamórficas. Porém, depois de ver o quão repugnante é essa transformação, Sir Hammerlock ficou extremamente enojado e pediu que você elimine quantos desses bichos você puder."

[M_MightyMorphin:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hammerlock pede que você procure por Varkids em [place]Tundra Express[-place], faça com que eles se transformem e logo em seguida, injete um soro especial em seus casulos para que ele possa estudar suas propriedades metamórficas. Porém, depois de ver o quão repugnante é essa transformação, Sir Hammerlock ficou extremamente enojado e pediu que você elimine quantos desses bichos você puder. Ele também lhe pediu que recolha algumas amostras dos cadáveres de Varkids mutados."

[M_MightyMorphin:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MightyMorphin:ObserveBugMorph MissionObjectiveDefinition]
ProgressMessage="Observe a transformação"

[M_MightyMorphin:PickUpSample MissionObjectiveDefinition]
ProgressMessage="Recolha amostras de Varkid Mutante"

[M_MightyMorphin:TakeInjector MissionObjectiveDefinition]
ProgressMessage="Pegue o injetor evolutivo"

[M_MightyMorphin:TakeInjector_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MightyMorphin:UseBugMorphPod MissionObjectiveDefinition]
ProgressMessage="Aplique o injetor no casulo"

